# AssetSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetSet Constructor
AssetSet Class See Also
---
Initializes a new instance of the AssetSet class
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AssetSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AssetSet()
```

# See Also
AssetSet Class
Autodesk.Revit.DB.Visual Namespace